In [1]:
import pandas as pd 

#create a series of datatime with a frequency of 10 hours
s = pd.date_range('2020-01-06', '2020-01-10', freq='10H').to_series()
s

2020-01-06 00:00:00   2020-01-06 00:00:00
2020-01-06 10:00:00   2020-01-06 10:00:00
2020-01-06 20:00:00   2020-01-06 20:00:00
2020-01-07 06:00:00   2020-01-07 06:00:00
2020-01-07 16:00:00   2020-01-07 16:00:00
2020-01-08 02:00:00   2020-01-08 02:00:00
2020-01-08 12:00:00   2020-01-08 12:00:00
2020-01-08 22:00:00   2020-01-08 22:00:00
2020-01-09 08:00:00   2020-01-09 08:00:00
2020-01-09 18:00:00   2020-01-09 18:00:00
Freq: 10H, dtype: datetime64[ns]

In [2]:
features = {
    "dayofweek": s.dt.dayofweek.values,
    "dayofyear": s.dt.dayofyear.values,
    "hour": s.dt.hour.values,
    "is_leap_year": s.dt.year.values,
    "quarter": s.dt.quarter.values,
    "weekofyear": s.dt.weekofyear.values
}

In [3]:
features

{'dayofweek': array([0, 0, 0, 1, 1, 2, 2, 2, 3, 3]),
 'dayofyear': array([6, 6, 6, 7, 7, 8, 8, 8, 9, 9]),
 'hour': array([ 0, 10, 20,  6, 16,  2, 12, 22,  8, 18]),
 'is_leap_year': array([2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020, 2020]),
 'quarter': array([1, 1, 1, 1, 1, 1, 1, 1, 1, 1]),
 'weekofyear': array([2, 2, 2, 2, 2, 2, 2, 2, 2, 2])}

In [4]:
df = pd.read_csv("date_data.csv")
df

         date  customer_id  cat1  cat2  cat3      num1
0  2016-09-01       146361     2     2     0 -0.518679
1  2017-04-01       180838     4     1     0  0.415853
2  2017-08-01       157857     3     3     1 -2.061687
3  2017-12-01       159772     5     1     1 -0.276558
4  2017-09-01        80014     3     2     1 -1.456827

In [17]:
datetimes = pd.to_datetime(df['date'])
datetimes

0   2016-09-01
1   2017-04-01
2   2017-08-01
3   2017-12-01
4   2017-09-01
Name: date, dtype: datetime64[ns]

In [18]:
df['date'] = datetimes
df['date']

0   2016-09-01
1   2017-04-01
2   2017-08-01
3   2017-12-01
4   2017-09-01
Name: date, dtype: datetime64[ns]

In [25]:
df.loc[:, 'year'] = df['date'].dt.year
df.loc[:, 'weekofyear'] = df['date'].dt.weekofyear
df.loc[:, 'month'] = df['date'].dt.month
df.loc[:, 'dayofweek'] = df['date'].dt.dayofweek
df.loc[:, 'weekend'] = (df.date.dt.weekday >=5).astype(int)
df.loc[:, 'hour'] = df['date'].dt.hour

In [26]:
df

,date,customer_id,cat1,cat2,cat3,num1,year,weekofyear,month,dayofweek,weekend,hour
0,2016-09-01,146361,2,2,0,-0.518679,2016,35,9,3,0,0
1,2017-04-01,180838,4,1,0,0.415853,2017,13,4,5,1,0
2,2017-08-01,157857,3,3,1,-2.061687,2017,31,8,1,0,0
3,2017-12-01,159772,5,1,1,-0.276558,2017,48,12,4,0,0
4,2017-09-01,80014,3,2,1,-1.456827,2017,35,9,4,0,0

In [30]:
df

,date,customer_id,cat1,cat2,cat3,num1,year,weekofyear,month,dayofweek,weekend,hour
0,2016-09-01,146361,2,2,0,-0.518679,2016,35,9,3,0,0
1,2017-04-01,180838,4,1,0,0.415853,2017,13,4,5,1,0
2,2017-08-01,157857,3,3,1,-2.061687,2017,31,8,1,0,0
3,2017-12-01,159772,5,1,1,-0.276558,2017,48,12,4,0,0
4,2017-09-01,80014,3,2,1,-1.456827,2017,35,9,4,0,0

In [33]:
features = {
"dayofweek": df.dayofweek.values,
"weekend": df.weekend.values,
"hour": df.hour.values,
"year": df.year.values,
"month": df.month.values,
"weekofyear": df.weekofyear.values
}
features

{'dayofweek': array([3, 5, 1, 4, 4]),
 'weekend': array([0, 1, 0, 0, 0]),
 'hour': array([0, 0, 0, 0, 0]),
 'year': array([2016, 2017, 2017, 2017, 2017]),
 'month': array([ 9,  4,  8, 12,  9]),
 'weekofyear': array([35, 13, 31, 48, 35])}

In [38]:
df = pd.read_csv("date_data.csv")
df
datetimes = pd.to_datetime(df['date'])
df['date'] = datetimes
df

        date  customer_id  cat1  cat2  cat3      num1
0 2016-09-01       146361     2     2     0 -0.518679
1 2017-04-01       180838     4     1     0  0.415853
2 2017-08-01       157857     3     3     1 -2.061687
3 2017-12-01       159772     5     1     1 -0.276558
4 2017-09-01        80014     3     2     1 -1.456827

In [42]:
def generate_features(df):
    df.loc[:, 'year'] = df['date'].dt.year
    df.loc[:, 'weekofyear'] = df['date'].dt.weekofyear
    df.loc[:, 'month'] = df['date'].dt.month
    df.loc[:, 'dayofweek'] = df['date'].dt.dayofweek
    df.loc[:, 'weekend'] = (df['date'].dt.weekday >=5).astype(int)

    # create an aggregate dictionary
    aggs = {}
    # for aggregation by month, we calculate the
    # number of unique month values and also the mean
    aggs['month'] = ['nunique', 'mean']
    aggs['weekofyear'] = ['nunique', 'mean']
    # we aggregate by num1 and calculate sum, max, min
    # and mean values of this column
    aggs['num1'] = ['sum','max','min','mean']
    # for customer_id, we calculate the total count
    aggs['customer_id'] = ['size']
    # again for customer_id, we calculate the total unique
    aggs['customer_id'] = ['nunique']
    # we group by customer_id and calculate the aggregates
    agg_df = df.groupby('customer_id').agg(aggs)
    agg_df = agg_df.reset_index()
    return agg_df

df2 = generate_features(df)
df2

  customer_id   month      weekofyear           num1                      \
              nunique mean    nunique mean       sum       max       min
0       80014       1    9          1   35 -1.456827 -1.456827 -1.456827
1      146361       1    9          1   35 -0.518679 -0.518679 -0.518679
2      157857       1    8          1   31 -2.061687 -2.061687 -2.061687
3      159772       1   12          1   48 -0.276558 -0.276558 -0.276558
4      180838       1    4          1   13  0.415853  0.415853  0.415853

            customer_id
       mean     nunique
0 -1.456827           1
1 -0.518679           1
2 -2.061687           1
3 -0.276558           1
4  0.415853           1

In [40]:
df

,date,customer_id,cat1,cat2,cat3,num1,year,weekofyear,month,dayofweek,weekend
0,2016-09-01,146361,2,2,0,-0.518679,2016,35,9,3,0
1,2017-04-01,180838,4,1,0,0.415853,2017,13,4,5,1
2,2017-08-01,157857,3,3,1,-2.061687,2017,31,8,1,0
3,2017-12-01,159772,5,1,1,-0.276558,2017,48,12,4,0
4,2017-09-01,80014,3,2,1,-1.456827,2017,35,9,4,0

In [45]:
import numpy as np 
feature_dict = {}
# calculate mean
x = df.cat1
feature_dict['mean'] = np.mean(x)
# calculate max
feature_dict['max'] = np.max(x)
# calculate min
feature_dict['min'] = np.min(x)
# calculate standard deviation
feature_dict['std'] = np.std(x)
# calculate variance
feature_dict['var'] = np.var(x)
# peak-to-peak
feature_dict['ptp'] = np.ptp(x)
# percentile features
feature_dict['percentile_10'] = np.percentile(x, 10)
feature_dict['percentile_60'] = np.percentile(x, 60)
feature_dict['percentile_90'] = np.percentile(x, 90)
# quantile features
feature_dict['quantile_5'] = np.quantile(x, 0.05)
feature_dict['quantile_95'] = np.quantile(x, 0.95)
feature_dict['quantile_99'] = np.quantile(x, 0.99)

In [46]:
feature_dict

{'mean': 3.4,
 'max': 5,
 'min': 2,
 'std': 1.019803902718557,
 'var': 1.04,
 'ptp': 3,
 'percentile_10': 2.4000000000000004,
 'percentile_60': 3.4,
 'percentile_90': 4.6,
 'quantile_5': 2.2,
 'quantile_95': 4.8,
 'quantile_99': 4.96}

In [47]:
df2.loc[:,'std'] = feature_dict['std']

In [48]:
df2

  customer_id   month      weekofyear           num1                      \
              nunique mean    nunique mean       sum       max       min
0       80014       1    9          1   35 -1.456827 -1.456827 -1.456827
1      146361       1    9          1   35 -0.518679 -0.518679 -0.518679
2      157857       1    8          1   31 -2.061687 -2.061687 -2.061687
3      159772       1   12          1   48 -0.276558 -0.276558 -0.276558
4      180838       1    4          1   13  0.415853  0.415853  0.415853

            customer_id       std
       mean     nunique
0 -1.456827           1  1.019804
1 -0.518679           1  1.019804
2 -2.061687           1  1.019804
3 -0.276558           1  1.019804
4  0.415853           1  1.019804

In [49]:
from tsfresh.feature_extraction import feature_calculators as fc
# tsfresh based features
feature_dict['abs_energy'] = fc.abs_energy(x)
feature_dict['count_above_mean'] = fc.count_above_mean(x)
feature_dict['count_below_mean'] = fc.count_below_mean(x)
feature_dict['mean_abs_change'] = fc.mean_abs_change(x)
feature_dict['mean_change'] = fc.mean_change(x)
feature_dict

{'mean': 3.4,
 'max': 5,
 'min': 2,
 'std': 1.019803902718557,
 'var': 1.04,
 'ptp': 3,
 'percentile_10': 2.4000000000000004,
 'percentile_60': 3.4,
 'percentile_90': 4.6,
 'quantile_5': 2.2,
 'quantile_95': 4.8,
 'quantile_99': 4.96,
 'abs_energy': 63,
 'count_above_mean': 2,
 'count_below_mean': 3,
 'mean_abs_change': 1.75,
 'mean_change': 0.25}